cylinder-flap-3d/OpenFOAM-FEniCS/Fluid/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    ddtSchemes
    {
        default backward;
    }

    gradSchemes
    {
        default Gauss linear;
    }

    divSchemes
    {
        default         none;
    	div(phi,U)      bounded Gauss linearUpwind limited;
        div((nuEff*dev2(T(grad(U))))) Gauss linear;
    }

    interpolationSchemes
    {
        default linear;
    }

    laplacianSchemes
    {
        default Gauss linear corrected;
    }

    snGradSchemes
    {
        default corrected;
    }

    wallDist
    {
        method meshWave;
    }

    fluxRequired
    {
        default no;
        p ;
        Phi ;
    }
